wlshiu/net/LPC4000/CMSIS/Driver/USBD_LPC40xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * $Date:        02. March 2016
 * $Revision:    V1.0
 *
 * Driver:       Driver_USBD0
 * Configured:   via RTE_Device.h configuration file
 * Project:      USB Device Driver for NXP LPC40xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                  Value
 *   ---------------------                  -----
 *   Connect to hardware via Driver_USBD# = 0
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *
 *   USBD_MAX_ENDPOINT_NUM:  defines maximum number of IN/OUT Endpoint pairs
 *                           that driver will support with Control Endpoint 0
 *                           not included, this value impacts driver memory
 *                           requirements
 *     - default value: 15
 *     - maximum value: 15
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.0
 *    Initial release for CMSIS Drivers v2.01 API
 */


#include <stdint.h>
#include <string.h>

#include "Driver_USBD.h"

#include "LPC407x_8x_177x_8x.h"

#include "USBD_LPC40xx.h"

#include "RTE_Device.h"
#include "RTE_Components.h"

#if      (RTE_USB_USB0 == 0)
#error   "USB is not enabled in the RTE_Device.h!"
#endif

#ifndef USBD_MAX_ENDPOINT_NUM
#define USBD_MAX_ENDPOINT_NUM           15U
#endif
#if    (USBD_MAX_ENDPOINT_NUM > 15)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 15 !!!
#endif

#ifndef USBD_CTRL_ENDPOINT_MASK
#define USBD_CTRL_ENDPOINT_MASK         (0x00000003U)
#endif
#ifndef USBD_INT_ENDPOINT_MASK
#define USBD_INT_ENDPOINT_MASK          (0x0C30C30CU)
#endif
#ifndef USBD_BULK_ENDPOINT_MASK
#define USBD_BULK_ENDPOINT_MASK         (0xF0C30C30U)
#endif
#ifndef USBD_ISO_ENDPOINT_MASK
#define USBD_ISO_ENDPOINT_MASK          (0x030C30C0U)
#endif

#define USBD_DRIVER_INITIALIZED         (1U     )
#define USBD_DRIVER_POWERED             (1U << 1)

extern uint8_t usb_role;
extern uint8_t usb_state;

extern int32_t USB_I2C_Initialize       (void);
extern int32_t USB_I2C_Uninitialize     (void);
extern int32_t USB_I2C_RegisterRead     (uint8_t i2c_addr, uint8_t reg_addr);
extern int32_t USB_I2C_RegisterWrite    (uint8_t i2c_addr, uint8_t reg_addr, uint8_t reg_val);
extern int32_t USB_I2C_DpPullUp         (bool enable);
extern int32_t USB_I2C_ControlDmPullUp  (bool enable);
extern int32_t USB_I2C_ControlPullDowns (bool enable);
extern int32_t USB_PinsConfigure        (void);
extern int32_t USB_PinsUnconfigure      (void);


// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
  1U,   // VBUS Detection
  1U,   // Event VBUS On
  1U    // Event VBUS Off
};

#define EP_PHY(ep_addr)                 ((((ep_addr) & 0x0FU) << 1) + (((ep_addr) >> 7) & 1U))

typedef struct {                        // Endpoint information structure
  uint8_t  *data;
  uint32_t  num;
  uint32_t  num_transferred_total;
  uint16_t  num_transferring;
  uint16_t  max_packet_size;
  uint8_t   type;
  uint8_t   active;
  uint8_t   out_irq_pending;
  uint8_t   reserved;
} ENDPOINT_t;

static ARM_USBD_SignalDeviceEvent_t   SignalDeviceEvent;
static ARM_USBD_SignalEndpointEvent_t SignalEndpointEvent;

static ARM_USBD_STATE      usbd_state;

static uint32_t            ep_iso_cfg_mask;
static uint32_t            ep_iso_act_mask;
static volatile uint8_t    usbd_int_active;
static volatile uint32_t   usbd_sie_busy;
static volatile uint8_t    setup_received;

static ENDPOINT_t          ep[(USBD_MAX_ENDPOINT_NUM + 1U) * 2U];

// Function prototypes
static int32_t USBD_EndpointConfigure (uint8_t ep_addr, uint8_t ep_type, uint16_t ep_max_packet_size);


// Auxiliary functions

// Function check_and_set_var tries to set variable (uint32_t) to 1 if it was
// interrupted or var was already 1 it returns false, if it succeeded it
// returns true (it uses load/store exclusive to achieve atomicity)
__inline static bool check_and_set_var (volatile uint32_t *addr) {
  bool val;
  do {
    val = __LDREXW (addr);
    if ((val & 1U) != 0U) {
      __CLREX ();
      return false;
    }
  } while (__STREXW (1, addr));
  return true;
}

/**
  \fn          void SIE_WrCmd (uint32_t cmd)
  \brief       Write command to Serial Interface Engine (SIE).
  \param[in]   cmd     Command
*/
static void SIE_WrCmd (uint32_t cmd) {

  LPC_USB->DevIntClr = USBD_CCEMTY_INT;
  LPC_USB->CmdCode   = cmd;
  while ((LPC_USB->DevIntSt & USBD_CCEMTY_INT) == 0U);
}

/**
  \fn          void SIE_WrCmdData (uint32_t cmd, uint32_t data)
  \brief       Write command data to Serial Interface Engine (SIE).
  \param[in]   cmd     Command
  \param[in]   data    Data
*/
static void SIE_WrCmdData (uint32_t cmd, uint32_t data) {

  LPC_USB->DevIntClr = USBD_CCEMTY_INT;
  LPC_USB->CmdCode   = cmd;
  while ((LPC_USB->DevIntSt & USBD_CCEMTY_INT) == 0U);
  LPC_USB->DevIntClr = USBD_CCEMTY_INT;
  LPC_USB->CmdCode   = data;
  while ((LPC_USB->DevIntSt & USBD_CCEMTY_INT) == 0U);
}

/**
  \fn          void SIE_EP_WrCmd (uint32_t ep_phy, uint32_t cmd)
  \brief       Write Endpoint command to Serial Interface Engine (SIE).
  \param[in]   ep_phy  Physical Endpoint index
  \param[in]   cmd     Command
*/
static void SIE_EP_WrCmd (uint32_t ep_phy, uint32_t cmd) {

  LPC_USB->DevIntClr = USBD_CCEMTY_INT;
  LPC_USB->CmdCode   = USBD_CMD_SEL_EP(ep_phy);
  while ((LPC_USB->DevIntSt & USBD_CCEMTY_INT) == 0U);
  LPC_USB->DevIntClr = USBD_CCEMTY_INT;
  LPC_USB->CmdCode   = cmd;
}

/**
  \fn          uint32_t SIE_RdCmdData (uint32_t cmd)
  \brief       Read command data from Serial Interface Engine (SIE).
  \param[in]   cmd  Command
  \return      Read command data
*/
static uint32_t SIE_RdCmdData (uint32_t cmd) {
  uint32_t CmdData;

  LPC_USB->DevIntClr = USBD_CCEMTY_INT | USBD_CDFULL_INT;
  LPC_USB->CmdCode   = cmd;
  while ((LPC_USB->DevIntSt & USBD_CDFULL_INT) == 0U);
  CmdData            = LPC_USB->CmdData;

