wlshiu/net/LPC4000/CMSIS/Driver/USBD_LPC40xx.c
  return CmdData;
}

/**
  \fn          void USBD_HW_BusReset (void)
  \brief       USB Bus Reset.
*/
static void USBD_HW_Reset (void) {

  // Disable Endpoint interrupts and clear all interrupts
  LPC_USB->EpIntEn   = 0U;
  LPC_USB->EpIntClr  = 0xFFFFFFFFU;
  LPC_USB->DevIntClr = 0xFFFFFFFFU;

  // Reset global variables
  setup_received       = 0U;
  memset((void *)&usbd_state, 0, sizeof(usbd_state));
  memset((void *)ep,          0, sizeof(ep));
  ep_iso_cfg_mask      = 0U;
  ep_iso_act_mask      = 0U;

  // Default Initialize Control Endpoint 0
  USBD_EndpointConfigure (0x00U, ARM_USB_ENDPOINT_CONTROL,  8U);
  USBD_EndpointConfigure (0x80U, ARM_USB_ENDPOINT_CONTROL,  8U);
}

/**
  \fn          void USBD_HW_ConfigEP (uint32_t ep_phy, uint32_t ep_max_packet_size)
  \brief       Configure Endpoint.
  \param[in]   ep_phy             Physical Endpoint index
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
*/
static void USBD_HW_ConfigEP (uint32_t ep_phy, uint32_t ep_max_packet_size) {

  LPC_USB->EpInd     = ep_phy;
  LPC_USB->MaxPSize  = ep_max_packet_size;
  while ((LPC_USB->DevIntSt & USBD_EP_RLZED_INT) == 0U);
  LPC_USB->DevIntClr = USBD_EP_RLZED_INT;
}

/**
  \fn          void USBD_HW_EnableEP (uint32_t ep_phy)
  \brief       Enable Endpoint.
  \param[in]   ep_phy Physical Endpoint index
*/
static void USBD_HW_EnableEP (uint32_t ep_phy) {

  LPC_USB->ReEp     |= 1U << ep_phy;    // Realize endpoint
  while ((LPC_USB->DevIntSt & USBD_EP_RLZED_INT) == 0U);
  LPC_USB->DevIntClr = USBD_EP_RLZED_INT;

  LPC_USB->EpIntEn  |= 1U << ep_phy;    // Enable Endpoint interrupts
}

/**
  \fn          USBD_HW_DisableEP (uint32_t ep_phy)
  \brief       Disable Endpoint.
  \param[in]   ep_phy  Physical Endpoint index
*/
static void USBD_HW_DisableEP (uint32_t ep_phy) {

  LPC_USB->EpIntEn  &= ~(1U << ep_phy); // Disable Endpoint interrupts

  LPC_USB->ReEp     &= ~(1U << ep_phy); // De-realize endpoint
  while ((LPC_USB->DevIntSt & USBD_EP_RLZED_INT) == 0U);
  LPC_USB->DevIntClr = USBD_EP_RLZED_INT;
}

/**
  \fn          uint32_t USBD_HW_ReadEP (uint32_t ep_log, uint8_t *data)
  \brief       Read data received on Endpoint.
  \param[in]   ep_log Logical Endpoint
  \param[out]  data   Pointer to buffer for data to read
  \return      Number of bytes read
*/
static uint32_t USBD_HW_ReadEP (uint32_t ep_log, uint8_t *data) {
  uint32_t ep_phy;
  uint32_t num, i, val;

  ep_phy = EP_PHY(ep_log);

  LPC_USB->Ctrl = ((ep_log & 0x0FU) << 2) | USBD_CTRL_RD_EN;

  do {
    num = LPC_USB->RxPLen;
  } while ((num & USBD_PKT_RDY) == 0U);
  num &= USBD_PKT_LNGTH_MASK;

  for (i = 0U; (i + 4U) <= num; i += 4U) {
    *((__packed uint32_t *)data) = LPC_USB->RxData;
    data += 4U;
  }
  if (i < num) {
    val = LPC_USB->RxData;
    for (; i < num; i++) {
      *(data++) = val;
      val >>= 8;
    }
  }

  LPC_USB->Ctrl = 0U;

  if (ep[ep_phy].type != ARM_USB_ENDPOINT_ISOCHRONOUS) {
    // Non-Isochronous Endpoint
    SIE_EP_WrCmd(ep_phy, USBD_CMD_CLR_BUF);
  }

  return num;
}

/**
  \fn          uint32_t USBD_HW_WriteEP (uint32_t ep_log, uint8_t *data, uint32_t num)
  \brief       Write data to be transferred on Endpoint.
  \param[in]   ep_log Logical Endpoint
  \param[out]  data   Pointer to buffer with data to write
  \param[in]   num    Number of data bytes to transfer
  \return      Number of bytes written
*/
static uint32_t USBD_HW_WriteEP (uint32_t ep_log, uint8_t *data, uint32_t num) {
  uint32_t ep_phy;
  uint32_t i;

  ep_phy = EP_PHY(ep_log | 0x80U);

  if (num > ep[ep_phy].max_packet_size) {
    num = ep[ep_phy].max_packet_size;
  }

  LPC_USB->Ctrl = ((ep_log & 0x0FU) << 2) | USBD_CTRL_WR_EN;

  LPC_USB->TxPLen = num;

  for (i = 0U; i < (num + 3U) / 4U; i++) {
    LPC_USB->TxData = *((__packed uint32_t *)data);
    data += 4U;
  }

  LPC_USB->Ctrl = 0U;

  SIE_EP_WrCmd(ep_phy, USBD_CMD_VALID_BUF);

  return num;
}


// USBD Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion (void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities (void) { return usbd_driver_capabilities; }

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) {

  if ((usb_state & USBD_DRIVER_INITIALIZED) != 0U) { return ARM_DRIVER_OK; }

  SignalDeviceEvent   = cb_device_event;
  SignalEndpointEvent = cb_endpoint_event;

  usb_role   =  ARM_USB_ROLE_DEVICE;

  if (USB_PinsConfigure () == -1) {
    usb_role = ARM_USB_ROLE_NONE;
    return ARM_DRIVER_ERROR;
  }

  usb_state |=  USBD_DRIVER_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_Uninitialize (void)
  \brief       De-initialize USB Device Interface.
  \return      \ref execution_status
*/
static int32_t USBD_Uninitialize (void) {

  if (USB_PinsUnconfigure () == -1) { return ARM_DRIVER_ERROR; }
  usb_role   =  ARM_USB_ROLE_NONE;
  usb_state  =  0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_PowerControl (ARM_POWER_STATE state)
  \brief       Control USB Device Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t USBD_PowerControl (ARM_POWER_STATE state) {

  switch (state) {
    case ARM_POWER_OFF:
      NVIC_DisableIRQ      (USB_IRQn);                  // Disable interrupt
      NVIC_ClearPendingIRQ (USB_IRQn);                  // Clear pending interrupt
      usb_state &= ~USBD_DRIVER_POWERED;                // Clear powered flag
                                                        // Reset variables
      setup_received =  0U;
      memset((void *)&usbd_state, 0, sizeof(usbd_state));

      LPC_SC->PCONP |=  (1UL << 31);                    // USB PCLK -> enable USB Peripheral
      LPC_USB->OTGClkCtrl |= 0x1AU;                     // Enable AHB, OTG and Device clocks
      while ((LPC_USB->OTGClkSt & 0x1AU) != 0x1AU);
      LPC_USB->USBClkCtrl |= 0x12U;                     // Enable AHB and Device clocks
      while ((LPC_USB->USBClkSt & 0x12U) != 0x12U);

