wlshiu/net/LPC4000/CMSIS/Driver/USBD_LPC40xx.c
      LPC_USB->DevIntEn = 0U;                           // Disable USB Controller Device interrupts

      LPC_USB->USBClkCtrl &= ~0x02U;                    // Disable Device clock
      while ((LPC_USB->USBClkSt & 0x02U) != 0U);

      if ((usb_state & 0xF0U) == 0U) {                  // If Host is not enabled
        LPC_USB->OTGClkCtrl &= ~0x02U;                  // Disable OTG Device clock
        while ((LPC_USB->OTGClkSt & 2U) != 0U);
        LPC_USB->USBClkCtrl &= ~0x10U;                  // Disable AHB clock
        while ((LPC_USB->USBClkSt & 0x10U) != 0U);
        LPC_USB->OTGClkCtrl &= ~0x18U;                  // Disable AHB and OTG clocks
        while ((LPC_USB->OTGClkSt & 0x18U) != 0U);
        LPC_SC->PCONP &= ~(1UL << 31);                  // USB PCLK -> disable USB Peripheral
      } else {                                          // If Host is enabled
        NVIC_EnableIRQ (USB_IRQn);                      // Enable interrupt
      }
      break;

    case ARM_POWER_FULL:
      if ((usb_state & USBD_DRIVER_INITIALIZED) == 0U) { return ARM_DRIVER_ERROR; }
      if ((usb_state & USBD_DRIVER_POWERED)     != 0U) { return ARM_DRIVER_OK; }

      LPC_SC->PCONP |=  (1UL << 31);                    // USB PCLK -> enable USB Peripheral
      LPC_USB->OTGClkCtrl |= 0x1AU;                     // Enable AHB, OTG and Device clocks
      while ((LPC_USB->OTGClkSt & 0x1AU) != 0x1AU);
      LPC_USB->USBClkCtrl |= 0x12U;                     // Enable AHB and Device clocks
      while ((LPC_USB->USBClkSt & 0x12U) != 0x12U);

      LPC_USB->USBClkCtrl |= 0x08U;                     // Enable port select register clocks
      while ((LPC_USB->USBClkSt & 0x08U) == 0U);
      LPC_USB->StCtrl &= ~0x03U;                        // Reset port function
      if (LPC_USB->StCtrl != RTE_USB_PORT_CFG) {
        LPC_USB->StCtrl |=  RTE_USB_PORT_CFG;           // Select port function
      }
#if ((RTE_USB_PORT1_EN == 1) && (RTE_USB_PORT1_OTG_EN == 1) && (RTE_USB_PORT_CFG == 0))
      USB_I2C_Initialize ();                            // Initialize I2C for OTG Transceiver
#endif
      LPC_USB->DevIntEn  = USBD_DEV_STAT_INT | USBD_EP_SLOW_INT;

      usb_state |=  USBD_DRIVER_POWERED;                // Set powered flag
      NVIC_EnableIRQ   (USB_IRQn);                      // Enable interrupt
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceConnect (void)
  \brief       Connect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceConnect (void) {

  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  SIE_WrCmdData (USBD_CMD_SET_DEV_STAT, USBD_DAT_WR_BYTE(USBD_DEV_CON));

#if ((RTE_USB_PORT1_EN == 1) && (RTE_USB_PORT1_OTG_EN == 1) && (RTE_USB_PORT_CFG == 0))
  USB_I2C_DpPullUp (true);
#endif

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceDisconnect (void)
  \brief       Disconnect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceDisconnect (void) {

  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

#if ((RTE_USB_PORT1_EN == 1) && (RTE_USB_PORT1_OTG_EN == 1) && (RTE_USB_PORT_CFG == 0))
  USB_I2C_DpPullUp (false);
#endif

  SIE_WrCmdData (USBD_CMD_SET_DEV_STAT, USBD_DAT_WR_BYTE(0));

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBD_DeviceGetState (void)
  \brief       Get current USB Device State.
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBD_DeviceGetState (void) {
  return usbd_state;
}

/**
  \fn          int32_t USBD_DeviceRemoteWakeup (void)
  \brief       Trigger USB Remote Wakeup.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceRemoteWakeup (void) {

  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  USBD_PowerControl (ARM_POWER_FULL);

  SIE_WrCmdData (USBD_CMD_SET_DEV_STAT, USBD_DAT_WR_BYTE(SIE_RdCmdData(USBD_CMD_GET_DEV_STAT) & (~USBD_DEV_SUS)));

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceSetAddress (uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBD_DeviceSetAddress (uint8_t dev_addr) {

  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  SIE_WrCmdData (USBD_CMD_SET_ADDR, USBD_DAT_WR_BYTE(USBD_DEV_EN | dev_addr));
  SIE_WrCmdData (USBD_CMD_SET_ADDR, USBD_DAT_WR_BYTE(USBD_DEV_EN | dev_addr));

  // Set device configured
  SIE_WrCmdData (USBD_CMD_CFG_DEV,  USBD_DAT_WR_BYTE(USBD_CONF_DVICE));

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_ReadSetupPacket (uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBD_ReadSetupPacket (uint8_t *setup) {

  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return ARM_DRIVER_ERROR;      }
  if (setup_received                    == 0U) { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  setup_received = 0U;
  USBD_HW_ReadEP (0, setup);

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  if (setup_received != 0U) {           // If new setup packet was received while this was being read
    return ARM_DRIVER_ERROR;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                               uint8_t  ep_type,
                                               uint16_t ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                       uint8_t  ep_type,
                                       uint16_t ep_max_packet_size) {
  ENDPOINT_t *ptr_ep;
  uint32_t    ep_phy;

  ep_phy = EP_PHY(ep_addr);
  ptr_ep = &ep[ep_phy];
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U))             { return ARM_DRIVER_ERROR;      }
  switch (ep_type) {
    case ARM_USB_ENDPOINT_CONTROL:
      if ((USBD_CTRL_ENDPOINT_MASK & (1U << ep_phy)) == 0U) { return ARM_DRIVER_ERROR;      }
      break;
    case ARM_USB_ENDPOINT_ISOCHRONOUS:
      if ((USBD_ISO_ENDPOINT_MASK  & (1U << ep_phy)) == 0U) { return ARM_DRIVER_ERROR;      }
      break;
    case ARM_USB_ENDPOINT_BULK:
      if ((USBD_BULK_ENDPOINT_MASK & (1U << ep_phy)) == 0U) { return ARM_DRIVER_ERROR;      }
      break;
    case ARM_USB_ENDPOINT_INTERRUPT:
      if ((USBD_INT_ENDPOINT_MASK  & (1U << ep_phy)) == 0U) { return ARM_DRIVER_ERROR;      }
      break;
    default:
      return ARM_DRIVER_ERROR;
  }
  if ((usb_state & USBD_DRIVER_POWERED) == 0U)              { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U)              { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  // Clear Endpoint settings in memory
  memset((void *)ptr_ep, 0, sizeof(ENDPOINT_t));

  // Store Endpoint settings in memory
  ptr_ep->type            = ep_type;
  ptr_ep->max_packet_size = ep_max_packet_size;
  if (ep_type == ARM_USB_ENDPOINT_ISOCHRONOUS) {
    // For isochronous endpoints transfers are handled on SOF
    ep_iso_cfg_mask |= (1U << ep_phy);
    if (ep_iso_cfg_mask != 0U) {
      LPC_USB->DevIntEn |= USBD_FRAME_INT;
    }
  }

