wlshiu/net/LPC4000/CMSIS/Driver/USBD_LPC40xx.c
  USBD_HW_ConfigEP (ep_phy, ep_max_packet_size);
  SIE_WrCmdData (USBD_CMD_SET_EP_STAT(ep_phy), USBD_DAT_WR_BYTE(0));
  USBD_HW_EnableEP (ep_phy);

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointUnconfigure (uint8_t ep_addr)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointUnconfigure (uint8_t ep_addr) {
  ENDPOINT_t *ptr_ep;
  uint32_t    ep_phy;

  ep_phy = EP_PHY(ep_addr);
  ptr_ep = &ep[ep_phy];
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U)) { return ARM_DRIVER_ERROR;      }
  if ((usb_state & USBD_DRIVER_POWERED) == 0U)  { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U)  { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  USBD_HW_DisableEP (ep_phy);

  if (ptr_ep->type == ARM_USB_ENDPOINT_ISOCHRONOUS) {
    ep_iso_cfg_mask &= ~(1U << ep_phy);
    if (ep_iso_cfg_mask != 0U) {
      LPC_USB->DevIntEn &= ~USBD_FRAME_INT;
    }
  }

  // Clear Endpoint settings in memory
  memset((void *)ptr_ep, 0, sizeof(ENDPOINT_t));

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \return      \ref execution_status
*/
static int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall) {
  uint32_t ep_phy;

  ep_phy = EP_PHY(ep_addr);
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U)) { return ARM_DRIVER_ERROR;      }
  if ((usb_state & USBD_DRIVER_POWERED) == 0U)  { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U)  { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  if (stall != 0U) {
    SIE_WrCmdData (USBD_CMD_SET_EP_STAT(ep_phy), USBD_DAT_WR_BYTE(USBD_EP_STAT_ST));
  } else {
    SIE_WrCmdData (USBD_CMD_SET_EP_STAT(ep_phy), USBD_DAT_WR_BYTE(0));
  }

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num) {
  ENDPOINT_t *ptr_ep;
  uint32_t    ep_phy, ep_msk;

  ep_phy = EP_PHY(ep_addr);
  ptr_ep = &ep[ep_phy];
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U)) { return ARM_DRIVER_ERROR;      }
  if ((usb_state & USBD_DRIVER_POWERED) == 0U)  { return ARM_DRIVER_ERROR;      }
  if (ptr_ep->active != 0U)                     { return ARM_DRIVER_ERROR_BUSY; }
  if (check_and_set_var(&usbd_sie_busy) == 0U)  { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  ep_msk = 1U << ep_phy;

  ptr_ep->data                  = data;
  ptr_ep->num                   = num;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring      = 0U;

  if ((ep_iso_cfg_mask & ep_msk) != 0U) {
    ep_iso_act_mask |= ep_msk;
  }

  // Ignore OUT ZLP request as it is automatically received by hardware and next SETUP
  // can over-write it before it was activated for transfer
  if ((ep_phy != 0U) || 
     ((ep_phy == 0U) && (num != 0U))) {
    if ((ep_addr & 0x80U) != 0U) {                                        // for IN Endpoint
      ptr_ep->active = 1U;
      ptr_ep->num_transferring = USBD_HW_WriteEP (ep_phy >> 1, ptr_ep->data, ptr_ep->num);
    } else {                                                              // for OUT Endpoint
      ptr_ep->active = 1U;
      if (ptr_ep->out_irq_pending != 0U) {                                // if something was already received
        ptr_ep->out_irq_pending = 0U;
        LPC_USB->EpIntSet = ep_msk;                                       // force interrupt to handle already received data
      }
    }
  }

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr) {
  uint32_t    ep_phy;

  ep_phy = EP_PHY(ep_addr);
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U)) { return 0U; }

  return (ep[ep_phy].num_transferred_total);
}

/**
  \fn          int32_t USBD_EndpointTransferAbort (uint8_t ep_addr)
  \brief       Abort current USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransferAbort (uint8_t ep_addr) {
  uint32_t ep_phy;

  ep_phy = EP_PHY(ep_addr);
  if (ep_phy > ((USBD_MAX_ENDPOINT_NUM+1U)*2U)) { return ARM_DRIVER_ERROR;      }
  if ((usb_state & USBD_DRIVER_POWERED) == 0U)  { return ARM_DRIVER_ERROR;      }
  if (check_and_set_var(&usbd_sie_busy) == 0U)  { return ARM_DRIVER_ERROR_BUSY; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  ep[ep_phy].active = 0U;
  if ((ep_iso_act_mask & (1U << ep_phy)) != 0U) {
    if ((ep_addr & 0x80) != 0U) { USBD_HW_WriteEP (ep_phy >> 1, NULL, 0); }
    ep_iso_act_mask &= ~(1U << ep_phy);
  }

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBD_GetFrameNumber (void)
  \brief       Get current USB Frame Number.
  \return      Frame Number
*/
static uint16_t USBD_GetFrameNumber (void) {
  uint16_t val;

