wlshiu/net/LPC4000/CMSIS/Driver/USBD_LPC40xx.c
  if ((usb_state & USBD_DRIVER_POWERED) == 0U) { return 0U; }
  if (check_and_set_var(&usbd_sie_busy) == 0U) { return 0U; }

  if (usbd_int_active == 0U) { NVIC_DisableIRQ(USB_IRQn); }

  SIE_WrCmd (USBD_CMD_RD_FRAME);
  val  = SIE_RdCmdData(USBD_DAT_RD_FRAME);
  val |= SIE_RdCmdData(USBD_DAT_RD_FRAME) << 8;

  usbd_sie_busy = 0U;
  if (usbd_int_active == 0U) { NVIC_EnableIRQ(USB_IRQn); }

  return val;
}

/**
  \fn          void USBD_IRQ (void)
  \brief       USB Device Interrupt Routine (IRQ).
*/
void USBD_IRQ (void) {
  ENDPOINT_t *ptr_ep;
  uint32_t    dev_isr, ep_isr, ep_msk, ep_log, ep_phy, val, len;
  uint32_t    evt_ep_in  = 0U;
  uint32_t    evt_ep_out = 0U;
  uint8_t     evt_stp    = 0U;
  uint8_t     cnt        = 0U;

  usbd_int_active  = 1U;

  dev_isr = LPC_USB->DevIntSt & LPC_USB->DevIntEn;      // Device Int Mask Stat

  // Device Status Interrupt (Reset, Connect change, Suspend/Resume)
  if ((dev_isr & USBD_DEV_STAT_INT) != 0U) {
    LPC_USB->DevIntClr = USBD_DEV_STAT_INT;
    SIE_WrCmd (USBD_CMD_GET_DEV_STAT);
    val = SIE_RdCmdData (USBD_DAT_GET_DEV_STAT);        // Get device status
    if ((val & USBD_DEV_CON_CH) != 0U) {                // Connect change
      if ((val & USBD_DEV_CON) != 0U) {                 // Connect
        usbd_state.vbus   = 1U;
        usbd_state.speed  = ARM_USB_SPEED_FULL;
        usbd_state.active = 1U;
        SignalDeviceEvent(ARM_USBD_EVENT_VBUS_ON);
      } else {                                          // Disconnect
        usbd_state.vbus   = 0U;
        usbd_state.speed  = 0U;
        usbd_state.active = 0U;
        SignalDeviceEvent(ARM_USBD_EVENT_VBUS_OFF);
      }
    }
    if ((val & USBD_DEV_SUS_CH) != 0U) {                // Suspend/Resume
      if ((val & USBD_DEV_SUS) != 0U) {                 // Suspend
        usbd_state.active = 0U;
        SignalDeviceEvent(ARM_USBD_EVENT_SUSPEND);
      } else {                                          // Resume
        usbd_state.active = true;
        SignalDeviceEvent(ARM_USBD_EVENT_RESUME);
      }
    }
    if ((val & USBD_DEV_RST) != 0U) {                   // Device Reset
      USBD_HW_Reset();
      SignalDeviceEvent(ARM_USBD_EVENT_RESET);
    }

    goto isr_end;
  }

  if ((dev_isr & USBD_FRAME_INT) != 0U) {               // Start of Frame Interrupt
    LPC_USB->DevIntClr = USBD_FRAME_INT;
    if ((ep_iso_cfg_mask & ep_iso_act_mask) != 0U) {
      for (ep_phy = 0U; ep_phy < ((USBD_MAX_ENDPOINT_NUM + 1U) * 2U); ep_phy++) {
        if ((ep_iso_cfg_mask & ep_iso_act_mask & (1U << ep_phy)) != 0U) {
          ptr_ep = &ep[ep_phy];
          if ((ep_phy & 1U) == 0U) {                    // ISO OUT Endpoint
            len = USBD_HW_ReadEP (ep_phy >> 1, ptr_ep->data + ptr_ep->num_transferred_total);
            ptr_ep->num_transferred_total += len;
            if ((ptr_ep->num_transferred_total == ptr_ep->num) ||       // if all data received or
                (len < ptr_ep->max_packet_size)) {                      // if short packet received
              ptr_ep->active = 0U;
              ep_iso_act_mask  &= ~(1U << ep_phy);
              evt_ep_out |= (1U << (ep_phy >> 1U));     // OUT event
            }
          } else {                                      // ISO IN  Endpoint
            ptr_ep->num_transferred_total += ptr_ep->num_transferring;
            if (ptr_ep->num_transferred_total == ptr_ep->num) {
              ptr_ep->active = 0U;
              ep_iso_act_mask  &= ~(1U << ep_phy);
              evt_ep_in  |= (1U << (ep_phy >> 1U));     // IN event
            } else {
              // Write data to send
              ptr_ep->num_transferring = USBD_HW_WriteEP (ep_phy >> 1, ptr_ep->data + ptr_ep->num_transferred_total, ptr_ep->num - ptr_ep->num_transferred_total);
            }
          }
        }
      }
    }
  }

  if ((dev_isr & USBD_EP_SLOW_INT) != 0U) {             // Endpoint's Slow Interrupt
    ep_isr = LPC_USB->EpIntSt & LPC_USB->EpIntEn;
    for (ep_phy = 0U; ep_isr; ep_phy++) {
      ep_msk = 1U << ep_phy;
      if ((ep_isr & ep_msk) != 0U) {
        ep_log = ep_phy >> 1;
        ptr_ep = &ep[ep_phy];
        ep_isr &= ~ep_msk;
        LPC_USB->EpIntClr = ep_msk;
        while ((LPC_USB->DevIntSt & USBD_CDFULL_INT) == 0U);
        val = LPC_USB->CmdData;
        if ((ep_phy & 1U) == 0U) {                      // OUT Endpoint
          if (val & USBD_EP_SEL_STP) {
            setup_received      = 1U;
            evt_stp = 1U;                               // SETUP event
          } else if (ptr_ep->active != 0U) {            // if transfer is active
            if (val & USBD_EP_SEL_ST) {
              cnt = 0U;                                 // if endpoint is stalled do not read data
            } else {
              cnt = ((val>>5) & 1U) + ((val >> 6) & 1U);// number of full buffers
            }
            if (cnt != 0U) {
              while (cnt != 0U) {                       // while received data
                len = USBD_HW_ReadEP (ep_log, ptr_ep->data + ptr_ep->num_transferred_total);
                ptr_ep->num_transferred_total += len;
                if ((ptr_ep->num_transferred_total == ptr_ep->num) ||   // if all data received or
                    (len < ptr_ep->max_packet_size)) {                  // if short packet received
                  ptr_ep->active = 0U;
                  evt_ep_out |= (1U << ep_log);         // OUT event
                  break;
                }
                cnt--;
              }
            }
          } else {                                      // if transfer not yet active
            // read OUT ZLP if it was received on Control 0 Endpoint
            if (val & USBD_EP_SEL_ST) {
              cnt = 0U;                                 // if endpoint is stalled do not read data
            } else {
              cnt = ((val>>5) & 1U) + ((val >> 6) & 1U);// number of full buffers
            }
            if (cnt != 0U) {
              ptr_ep->out_irq_pending = 1U;
            }
          }
        } else {                                        // IN Endpoint
          if (ptr_ep->active != 0U) {                   // if transfer is active
            ptr_ep->num_transferred_total += ptr_ep->num_transferring;
            if (ptr_ep->num_transferred_total == ptr_ep->num) {
              ptr_ep->active = 0U;
              evt_ep_in |= (1U << ep_log);              // IN event
            } else {
              // Write data to send
              ptr_ep->num_transferring = USBD_HW_WriteEP (ep_log, ptr_ep->data + ptr_ep->num_transferred_total, ptr_ep->num - ptr_ep->num_transferred_total);
            }
          }
        }
      }
    }
    LPC_USB->DevIntClr = USBD_EP_SLOW_INT;
  }

  if (evt_ep_in != 0U) {                // If IN event should be signalled
    ep_msk = 1U;
    for (ep_log = 0U; ep_log <= USBD_MAX_ENDPOINT_NUM; ep_log++) {
      if ((evt_ep_in & ep_msk) != 0U) {
        evt_ep_in &= ~ep_msk;
        SignalEndpointEvent(ep_log | 0x80U, ARM_USBD_EVENT_IN);
      }
      if (evt_ep_in == 0U) { break; }
      ep_msk <<= 1U;
    }
  }
  if (evt_ep_out != 0U) {               // If OUT event should be signalled
    ep_msk = 1U;
    for (ep_log = 0U; ep_log <= USBD_MAX_ENDPOINT_NUM; ep_log++) {
      if ((evt_ep_out & ep_msk) != 0U) {
        evt_ep_out &= ~ep_msk;
        SignalEndpointEvent(ep_log, ARM_USBD_EVENT_OUT);
      }
      if (evt_ep_out == 0U) { break; }
      ep_msk <<= 1U;
    }
  }
  if (evt_stp) { SignalEndpointEvent(0U, ARM_USBD_EVENT_SETUP); }

isr_end:
  usbd_int_active = 0U;
}

ARM_DRIVER_USBD Driver_USBD0 = {
  USBD_GetVersion,
  USBD_GetCapabilities,
  USBD_Initialize,
  USBD_Uninitialize,
  USBD_PowerControl,
  USBD_DeviceConnect,
  USBD_DeviceDisconnect,
  USBD_DeviceGetState,
  USBD_DeviceRemoteWakeup,
  USBD_DeviceSetAddress,
  USBD_ReadSetupPacket,
  USBD_EndpointConfigure,
  USBD_EndpointUnconfigure,
  USBD_EndpointStall,
  USBD_EndpointTransfer,
  USBD_EndpointTransferGetResult,
  USBD_EndpointTransferAbort,
  USBD_GetFrameNumber
};
